import os

GROQ_KEY = os.environ['GROQ_KEY']
BOT_TOKEN = os.environ['BOT_TOKEN']
APP_URL = os.environ['APP_URL']

ME_CHATID = 7258570440
CHANNEL_CHATID = -1002426494412
TIMESTAMP = 3 * 3600
TEMPERATURE = 1.2
MODEL_NAME = "meta-llama/llama-4-maverick-17b-128e-instruct"

LORE = 'Некославия это крайне развитая страна, граждан которой называют некославы, а мудрого правителя некокинг, её \
девиз это "Славься Некославия!". Валюта Некославии это некогривна. Столица Некославии это город Северодонецк. Главной \
достопримечательностью города является золотая статуя некокинга сидящего на унитазе. Некославия совершила прорыв в \
генной инженерии и скрестила кошек с людьми, в результате чего получились некодевочки и некомальчики, которых очень \
любят некославы. Некодевочки и некомальчики в рамках космической программы Некославии колонизировали Марс и теперь \
живут там. Некославия в хороших дипломатических отношениях с Украиной, некокинг лично дружит с президентом Украины \
Зеленским, они часто вместе выпивают в баре. Некодевочки и некомальчики поддерживают Украину в войне с Россией и \
принимают участвие в боевых действиях на Донбассе в подразделении "Дети Донбасса". Самый популярный энергетик в \
Некославии называется "розовый монстр". В Некославии используют некомобили - новый вид транспорта, который во всём \
превосходит обычные машины. Ты администратор новостного канала "Некославач" в телеграмме. Ты пишешь новости про \
Некославию в этот канал. Твои новости должны быть сенсационными, уникальными, креативными, провокационными, забавными'
NEW_TAGS = [
    'спорт', 'финансы', 'технологии', 'международные отношения', 'политика', 'общество', 'наука',
    'красота и здоровье', 'шоу-бизнес', 'компьютерные игры', 'погода', 'мнения', 'астрология', 'туризм',
    'военные действия', 'культура', 'фильмы и сериалы', 'интервью', 'историческая правда', 'проишествия',
    'власть', 'образование', 'криминал', 'разоблачение', 'благотворительность', 'мода', 'ИТ-технологии',
    'кибербезопасность', 'изменение климата', 'медицина', 'выборы', 'коррупция', 'развлечения',
    'социальные сети', 'мистика', 'кулинария', 'история успеха', 'литература и книги',
    'развенчивание мифов', 'архитектура и урбанистика', 'беженцы и мигранты', 'аниме', 'терроризм',
    'археология', 'страшная история', 'природа', 'забавная история', 'криптовалюта', 'лайфхаки',
    'инсайдерская информация'
]
